#ifndef SGO_COLLECT_DATA_H
#define SGO_COLLECT_DATA_H

#include <vector>
#include <string>
#include <mutex>
#include <boost/any.hpp>

//#define TEST
#define DEBUG
//#define DEMO
//#define JANA505
//#define JANA508509
#define MAHTS648

#define CUMMINS_DCU_NUMS 336
#define PLC1_AI_NUMS 56
#define PLC1_DI_NUMS 6
#define PLC1_DI_WRITE_NUMS 3
#define PLC2_AI_NUMS 16
#define PLC2_DI_NUMS 10
#define PLC2_DI_WRITE_NUMS 1

#define PLATFORM_JACKING_SYSTEM_NUMS 207

#define MAIN_PROPULSION_IP_MOXA "192.168.20.30"
#define POWER_SYSTEM_IP "192.168.20.13"
#define MAIN_PROPULSION_IP1 "192.168.20.14"
#define MAIN_PROPULSION_IP2 "192.168.20.15"
#define SAU_IP0 "192.168.20.221"
#define SAU_IP1 "192.168.20.222"
#define SAU_IP2 "192.168.20.223"
#define MOXA_IP1 "192.168.20.224"
#define MOXA_IP2 "192.168.20.225"
enum {
	MOXA_NPORT_1 = 10001,
	MOXA_NPORT_2,
	MOXA_NPORT_3,
	MOXA_NPORT_4,
	MOXA_NPORT_5,
	MOXA_NPORT_6,
	MOXA_NPORT_7,
	MOXA_NPORT_8,	
};
#define EXP_IP1 "192.168.20.211"
#define EXP_IP2 "192.168.20.212"
#define EXP_IP3 "192.168.20.213"
#define EXP_IP4 "192.168.20.214"
#define EXP_IP5 "192.168.20.215"
#define EXP_IP6 "192.168.20.216"
#define EXP_IP_PREFIX "192.168.20.21"
#define DG_IP_PREFIX "192.168.20.10"
#define PC_IP_PREFIX "192.168.20.20"
#define MQTT_IP_PREFIX "192.168.20.20"

const int mqtt_proxy_nums = 2;//4;
#if defined(JANA505)
const int main_gens_nums = 6;
#endif
#if defined(MAHTS648)
const int main_gens_nums = 4;
#endif
#ifdef JANA508509
const int main_gens_nums = 5;
#endif
const int baudouin_main_gens_nums=2;
const int main_propulsion_nums = 2;
const int main_transformer_nums = 2;
const int bow_thruster_nums = 2;
const int buzzer_nums = 3;
const int extend_alarm_panel_nums = 7;
const int pc_nums = 2;// 4;
const int sau_nums =  2;

const int threshold_low = -10000;
const int threshold_high = 10000;

typedef std::vector<std::vector<std::string>> StringList;

typedef struct{
	uint16_t baseAddr = 0;

	//value
    uint16_t vStartWord = 0xffff;
	uint16_t vStartBit = 0xffff;
	//H-A
    std::pair<uint16_t, uint16_t> ha_bit{0xffff, 0xffff};
    //L-A
    std::pair<uint16_t, uint16_t> la_bit{0xffff, 0xffff};

	//HH-A

	//LL-A

    //range
	std::pair<float, float> range{-10000.0, -10000.0};

	//INHIBIT
    bool inhibit = false;

    boost::any value;
}value_type;  //write extern alarm panle


typedef struct
{
	std::string deviceCode;
	std::string alarmType;
	std::string itemKey;
} alarm_type;

typedef struct{
	int indx; //com口号
	std::vector<std::string> data;
	std::string errmsg;
}data_test;

typedef struct{
	int id;
	int errCode;
	std::string data;
	std::string errmsg;
}alarm_test;

typedef struct{
	int id;
	std::vector<unsigned char> m_vdata;
}qz_data;

typedef struct{
	std::vector<uint16_t> m_vdata;
}km_data;

typedef struct {
	std::string m_name;
	union {
		int m_i;
		double m_d;
	}m_value;
	char m_value_type;//0:int 1:double
	int m_index;
}property_index_array;


/////////////////////////////////////////AMS start/////////////////////////////////////////////////////////
//
//主推进
typedef struct{
	int no;
	int main_propulsion_control_position;
	float main_propulsion_rudder_indication;
	float main_propulsion_vfd_rpm_indication;
	float main_propulsion_vfd_load_indication;
	float main_propulsion_motor_u_winding_temperature;
	float main_propulsion_motor_v_winding_temperature;
	float main_propulsion_motor_w_winding_temperature;
	float main_propulsion_motor_de_bearing_temperature;
	float main_propulsion_motor_nde_bearing_temperature;
	float main_propulsion_motor_air_inlet_temperature;
	float main_propulsion_motor_air_outlet_temperature;
	char main_propulsion_rudder_feedback_signal_missing;
	char main_propulsion_control_system_main_power_failure;
	char main_propulsion_control_system_backup_power_failure;
	char main_propulsion_steering_command_missing_joystick;
	char main_propulsion_speed_command_missing_joystick;
	char main_propulsion_fu_steering_control_failure;
	char main_propulsion_fu_speed_control_failure;
	char main_propulsion_vfd_speed_feedback_signal_missing;
	char main_propulsion_vfd_load_feedback_signal_missing;
	char main_propulsion_steering_command_missing_fwd_console;
	char main_propulsion_speed_command_missing_fwd_console;
	char main_propulsion_rudder_command_missing_aft_console;
	char main_propulsion_speed_command_missing_aft_console;
	char azimuth_thruster_common_alarm;
	char azimuth_thruster_fault;
	char main_propulsion_remote_control_system_communication_failure;
#if defined(MAHTS648)
	char propulsion_vfd_isu_communication_lost;  //506
	char propulsion_vfd_inu_communication_lost;  //506
	char propulsion_vfd_lcu_communication_lost;  //506
	char main_propulsion_vfd_stop_temp;   //506
	char main_propulsion_vfd_control_power_failure_ups;   //506
	char main_propulsion_vfd_isu_fault;  //506
    char main_propulsion_vfd_inu_fault;  //506
    char main_propulsion_vfd_lcu_fault;  //506
	char azimuth_thruster_steering_vfd_fault_2;  //506
	char main_propulsion_vfd_inu_waring;  //506
    char main_propulsion_vfd_lcu_waring;  //506
#endif
	char main_propulsion_vfd_fault;
	char main_propulsion_vfd_common_alarm;
	char main_propulsion_vfd_emergency_stop;
	char main_propulsion_vfd_emergency_stop_wire_broken;
	char main_propulsion_vfd_power_limit;
    char azimuth_thruster_steering_vfd_fault;
	char main_propulsion_vfd_slowdown_pre_alarm;
	char main_propulsion_motor_water_leakage;
	char main_propulsion_motor_de_leakage;
	char main_propulsion_motor_nde_leakage;
	char main_propulsion_motor_u_winding_temrpeature_high;
	char main_propulsion_motor_v_winding_temrpeature_high;
	char main_propulsion_motor_w_winding_temrpeature_high;
	char main_propulsion_motor_high_temrpeature_slowdown;
	char main_propulsion_motor_high_temrpeature_shutdown;
	char main_propulsion_motor_de_bearing_high_temperature_alarm;
	char main_propulsion_motor_de_bearing_high_temperature_slowdown;
	char main_propulsion_motor_de_bearing_high_temperature_shutdown;
	char main_propulsion_motor_nde_bearing_high_temperature_alarm;
	char main_propulsion_motor_nde_bearing_high_temperature_slowdown;
	char main_propulsion_motor_nde_bearing_high_temperature_shutdown;
#if defined(MAHTS648)
	char main_propulsion_vfd_cooling_water_inlet_pressure_low_alarm;  //506
	char main_propulsion_vfd_cooling_water_inlet_pressure_low_low_alarm;  //506
	char main_propulsion_vfd_cooling_water_inlet_pressure_low_low_fault;  //506
	char main_propulsion_vfd_lcu_outlet_pressure_high_alarm;  //506
	char main_propulsion_vfd_lcu_diff_pressure_low_alarm;  //506
	char main_propulsion_vfd_lcu_diff_pressure_low_low_fault;  //506
	char main_propulsion_shaft_lock_status;  //506
	char main_propulsion_vfd_heater_on;  //506
	char main_propulsion_vfd_power_on;  //506
 	char main_propulsion_motor_heater_on;  //506
    char main_propulsion_vfd_fu_nfu_mode;  //506
	char azimuth_thruster_fu_nfu_mode;  //506
	char azimuth_thruster_vfd_running;  //506
    char azimuth_thruster_steering_power_supply_fault;  //506
#endif
	char main_propulsion_vfd_control_mode;
	char main_propulsion_steering_control_nfu_mode;
    char main_propulsion_vfd_ready;
    char main_propulsion_vfd_remote_control_position;
	char main_propulsion_vfd_running;
	char main_propulsion_vfd_override;
    char main_propulsion_vfd_start_interlock;
	char main_propulsion_motor_air_inlet_high_temperature_alarm;
	char main_propulsion_motor_air_outlet_high_temperature_alarm;
	char main_propulsion_motor_high_temrpeature_slowdown_pre_alarm;
	char main_propulsion_motor_high_temrpeature_shutdown_pre_alarm;
	char main_propulsion_motor_de_bearing_high_temp_slowdown_pre_alarm;
	char main_propulsion_motor_de_bearing_high_tem_shutdown_pre_alarm;
	char main_propulsion_motor_nde_bearing_high_temp_slowdown_pre_alarm;
	char main_propulsion_motor_nde_bearing_high_tem_shutdown_pre_alarm;
	char main_propulsion_emergency_control_mode;
	char main_propulsion_shaft_lock_indication;
	char main_propulsion_vfd_torque_limitation;
	char main_propulsion_speed_control_nfu_mode;
	char azimuth_thruster_vfd1_running;
	char azimuth_thruster_vfd2_running;
	char azimuth_thruster_ready;
	char main_propulsion_joystick_control_permission;
	char main_propulsion_ap_control_permission;
	char azimuth_thruster_main_power_failure;
	char azimuth_thruster_backup_power_failure;
	char azimuth_thruster_shaft_lock_inlet_air_pressure_low_alarm;
	char azimuth_thruster_lub_oil_level_low_alarm;
	char azimuth_thruster_lub_oil_temp_high_alarm;
	char azimuth_thruster_lub_oil_filter_blocked_alarm;
	char azimuth_thruster_lub_oil_press_low_alarm;
	char azimuth_thruster_sealing_oil_tank_level_low_alarm;
	char azimuth_thruster_vfd1_fault;
	char azimuth_thruster_vfd2_fault;
	char azimuth_thruster_fu_steering_fault;
	char azimuth_thruster_lub_motor1_overload_alarm;
	char azimuth_thruster_lub_motor2_overload_alarm;
	char azimuth_thruster_angle_order_lost_alarm;
	char azimuth_thruster_angle_feedback_lost_alarm;
	char azimuth_thruster_steering_power1_supply_fault;
	char azimuth_thruster_steering_power2_supply_fault;
	char azimuth_thruster_sealing_oil_inlet_air_press_low_alarm;
	char azimuth_thruster_sealing_oil_inlet_air_press_high_alarm;
	char azimuth_thruster_steering_motor1_temp_high_alarm;
	char azimuth_thruster_steering_motor2_temp_high_alarm;
	float main_propulsion_vfd_speed_reference;
	float main_propulsion_vfd_actual_speed;
	float main_propulsion_vfd_actual_torque;
	float main_propulsion_motor_current;
	float main_propulsion_vfd_dc_voltage;
	float main_propulsion_motor_power;
#if defined(MAHTS648)
	float main_propulsion_vfd_voltage;  //506
	float main_propulsion_vfd_current;  //506
	float main_propulsion_lcu_inlet_pressure;  //506
	float main_propulsion_lcu_outlet_pressure;  //506
	float main_propulsion_vfd_cooling_water_differential_pressure;  //506
	float azimuth_thruster_angle_feedback;  //506
#endif
	char device_offline;
}main_propulsion;

typedef struct{
	int no;
	value_type main_propulsion_control_position;
	value_type main_propulsion_rudder_indication;
	value_type main_propulsion_vfd_rpm_indication;
	value_type main_propulsion_vfd_load_indication;
	value_type main_propulsion_motor_u_winding_temperature;
	value_type main_propulsion_motor_v_winding_temperature;
	value_type main_propulsion_motor_w_winding_temperature;
	value_type main_propulsion_motor_de_bearing_temperature;
	value_type main_propulsion_motor_nde_bearing_temperature;
	value_type main_propulsion_motor_air_inlet_temperature;
	value_type main_propulsion_motor_air_outlet_temperature;
	value_type main_propulsion_rudder_feedback_signal_missing;
	value_type main_propulsion_control_system_main_power_failure;
	value_type main_propulsion_control_system_backup_power_failure;
	value_type main_propulsion_steering_command_missing_joystick;
	value_type main_propulsion_speed_command_missing_joystick;
	value_type main_propulsion_fu_steering_control_failure;
	value_type main_propulsion_fu_speed_control_failure;
	value_type main_propulsion_vfd_speed_feedback_signal_missing;
	value_type main_propulsion_vfd_load_feedback_signal_missing;
	value_type main_propulsion_steering_command_missing_fwd_console;
	value_type main_propulsion_speed_command_missing_fwd_console;
	value_type main_propulsion_rudder_command_missing_aft_console;
	value_type main_propulsion_speed_command_missing_aft_console;
	value_type azimuth_thruster_common_alarm;
	value_type azimuth_thruster_fault;
	value_type main_propulsion_remote_control_system_communication_failure;
#if defined(MAHTS648)
	value_type propulsion_vfd_isu_communication_lost;  //506
	value_type propulsion_vfd_inu_communication_lost;  //506
	value_type propulsion_vfd_lcu_communication_lost;  //506
	value_type main_propulsion_vfd_stop_temp;   //506
	value_type main_propulsion_vfd_control_power_failure_ups;   //506
	value_type main_propulsion_vfd_isu_fault;  //506
    value_type main_propulsion_vfd_inu_fault;  //506
    value_type main_propulsion_vfd_lcu_fault;  //506
	value_type azimuth_thruster_steering_vfd_fault_2;  //506
	value_type main_propulsion_vfd_inu_waring;  //506
    value_type main_propulsion_vfd_lcu_waring;  //506
#endif
	value_type main_propulsion_vfd_fault;
	value_type main_propulsion_vfd_common_alarm;
	value_type main_propulsion_vfd_emergency_stop;
	value_type main_propulsion_vfd_emergency_stop_wire_broken;
	value_type main_propulsion_vfd_power_limit;
    value_type azimuth_thruster_steering_vfd_fault;
	value_type main_propulsion_vfd_slowdown_pre_alarm;
	value_type main_propulsion_motor_water_leakage;
	value_type main_propulsion_motor_de_leakage;
	value_type main_propulsion_motor_nde_leakage;
	value_type main_propulsion_motor_u_winding_temrpeature_high;
	value_type main_propulsion_motor_v_winding_temrpeature_high;
	value_type main_propulsion_motor_w_winding_temrpeature_high;
	value_type main_propulsion_motor_high_temrpeature_slowdown;
	value_type main_propulsion_motor_high_temrpeature_shutdown;
	value_type main_propulsion_motor_de_bearing_high_temperature_alarm;
	value_type main_propulsion_motor_de_bearing_high_temperature_slowdown;
	value_type main_propulsion_motor_de_bearing_high_temperature_shutdown;
	value_type main_propulsion_motor_nde_bearing_high_temperature_alarm;
	value_type main_propulsion_motor_nde_bearing_high_temperature_slowdown;
	value_type main_propulsion_motor_nde_bearing_high_temperature_shutdown;
#if defined(MAHTS648)
	value_type main_propulsion_vfd_cooling_water_inlet_pressure_low_alarm;  //506
	value_type main_propulsion_vfd_cooling_water_inlet_pressure_low_low_alarm;  //506
	value_type main_propulsion_vfd_cooling_water_inlet_pressure_low_low_fault;  //506
	value_type main_propulsion_vfd_lcu_outlet_pressure_high_alarm;  //506
	value_type main_propulsion_vfd_lcu_diff_pressure_low_alarm;  //506
	value_type main_propulsion_vfd_lcu_diff_pressure_low_low_fault;  //506
	value_type main_propulsion_shaft_lock_status;  //506
	value_type main_propulsion_vfd_heater_on;  //506
	value_type main_propulsion_vfd_power_on;  //506
 	value_type main_propulsion_motor_heater_on;  //506
    value_type main_propulsion_vfd_fu_nfu_mode;  //506
	value_type azimuth_thruster_fu_nfu_mode;  //506
	value_type azimuth_thruster_vfd_running;  //506
    value_type azimuth_thruster_steering_power_supply_fault;  //506
#endif
	value_type main_propulsion_vfd_control_mode;
	value_type main_propulsion_steering_control_nfu_mode;
    value_type main_propulsion_vfd_ready;
    value_type main_propulsion_vfd_remote_control_position;
	value_type main_propulsion_vfd_running;
	value_type main_propulsion_vfd_override;
    value_type main_propulsion_vfd_start_interlock;
	value_type main_propulsion_motor_air_inlet_high_temperature_alarm;
	value_type main_propulsion_motor_air_outlet_high_temperature_alarm;
	value_type main_propulsion_motor_high_temrpeature_slowdown_pre_alarm;
	value_type main_propulsion_motor_high_temrpeature_shutdown_pre_alarm;
	value_type main_propulsion_motor_de_bearing_high_temp_slowdown_pre_alarm;
	value_type main_propulsion_motor_de_bearing_high_tem_shutdown_pre_alarm;
	value_type main_propulsion_motor_nde_bearing_high_temp_slowdown_pre_alarm;
	value_type main_propulsion_motor_nde_bearing_high_tem_shutdown_pre_alarm;
	value_type main_propulsion_emergency_control_mode;
	value_type main_propulsion_shaft_lock_indication;
	value_type main_propulsion_vfd_torque_limitation;
	value_type main_propulsion_speed_control_nfu_mode;
	value_type azimuth_thruster_vfd1_running;
	value_type azimuth_thruster_vfd2_running;
	value_type azimuth_thruster_ready;
	value_type main_propulsion_joystick_control_permission;
	value_type main_propulsion_ap_control_permission;
	value_type azimuth_thruster_main_power_failure;
	value_type azimuth_thruster_backup_power_failure;
	value_type azimuth_thruster_shaft_lock_inlet_air_pressure_low_alarm;
	value_type azimuth_thruster_lub_oil_level_low_alarm;
	value_type azimuth_thruster_lub_oil_temp_high_alarm;
	value_type azimuth_thruster_lub_oil_filter_blocked_alarm;
	value_type azimuth_thruster_lub_oil_press_low_alarm;
	value_type azimuth_thruster_sealing_oil_tank_level_low_alarm;
	value_type azimuth_thruster_vfd1_fault;
	value_type azimuth_thruster_vfd2_fault;
	value_type azimuth_thruster_fu_steering_fault;
	value_type azimuth_thruster_lub_motor1_overload_alarm;
	value_type azimuth_thruster_lub_motor2_overload_alarm;
	value_type azimuth_thruster_angle_order_lost_alarm;
	value_type azimuth_thruster_angle_feedback_lost_alarm;
	value_type azimuth_thruster_steering_power1_supply_fault;
	value_type azimuth_thruster_steering_power2_supply_fault;
	value_type azimuth_thruster_sealing_oil_inlet_air_press_low_alarm;
	value_type azimuth_thruster_sealing_oil_inlet_air_press_high_alarm;
	value_type azimuth_thruster_steering_motor1_temp_high_alarm;
	value_type azimuth_thruster_steering_motor2_temp_high_alarm;
	value_type main_propulsion_vfd_speed_reference;
	value_type main_propulsion_vfd_actual_speed;
	value_type main_propulsion_vfd_actual_torque;
	value_type main_propulsion_motor_current;
	value_type main_propulsion_vfd_dc_voltage;
	value_type main_propulsion_motor_power;
#if defined(MAHTS648)
	value_type main_propulsion_vfd_voltage;  //506
	value_type main_propulsion_vfd_current;  //506
	value_type main_propulsion_lcu_inlet_pressure;  //506
	value_type main_propulsion_lcu_outlet_pressure;  //506
	value_type main_propulsion_vfd_cooling_water_differential_pressure;  //506
	value_type azimuth_thruster_angle_feedback;  //506
#endif
	value_type device_offline;
}main_propulsion_store;

//配电系统
typedef struct{
	char dg_start_fail;
	char eg_running;
	char eg_cb_close;
	char esb_dc24v_power_failure;
	char eg_breaker_trip;
	char eg_over_current;
	char esb_common_alarm;
	char esb_ac440v_bus_low_insulation;
	char esb_ac230v_bus_low_insulation;
	char esb_auto_mode;
	char no1_main_transformer_breaker_trip;
	char no2_main_transformer_breaker_trip;
	char no1_main_crane_cb_close;
	char no2_main_crane_cb_close;
	char no1_jacking_system_phase_transformer_cb_close;
	char no2_jacking_system_phase_transformer_cb_close;
	char no3_jacking_system_phase_transformer_cb_close;
	char no4_jacking_system_phase_transformer_cb_close;
	char no1_bow_thruster_cb_close;
	char no2_bow_thruster_cb_close;
	char no1_main_propulsion_vfd_cb_close;
	char no2_main_propulsion_vfd_cb_close;
	char dg1_ppm_fault;
	char dg2_ppm_fault;
	char dg3_ppm_fault;
